Repository: DiegoAlessandroMotta/medrush-app
Catalog: frontend/lib/l10n/app_*.arb
Languages: es

# loginTitle
source: Login
es: Iniciar Sesión

# loginSubtitle
source: Enter your credentials to access
es: Ingresa tus credenciales para acceder

# emailLabel
source: Email Address
es: Correo electrónico

# emailHint
source: example@medrush.com
es: ejemplo@medrush.com

# passwordLabel
source: Password
es: Contraseña

# passwordHint
source: Enter your password
es: Ingresa tu contraseña

# capsLockActive
source: Caps Lock is active
es: Bloq Mayús está activo

source: Logging in...
es: Iniciando sesión...

# sessionExpiredWarning
source: Your session has expired. Please login again.
es: Tu sesión ha expirado. Por favor, inicia sesión de nuevo.

# downloadApkTooltip
source: Download Android APP (APK)
es: Descargar APP Android (APK)

# checkingConnection
source: Checking server connection...
es: Verificando conexión al servidor...

# serverConnectionError
source: Could not connect to the server
es: No se pudo conectar con el servidor

# deliveriesTab
source: Deliveries
es: Entregas

# historyTab
source: History
es: Historial

# routeTab
source: Route
es: Ruta

# profileTab
source: Profile
es: Perfil

source: Search orders...
es: Buscar pedidos...

source: Filter
es: Filtrar

source: Call
es: Llamar

source: Navigate
es: Navegar

source: Deliver
es: Entregar

source: View Details
es: Ver Detalles

# noActiveOrders
source: You have no active orders
es: No tienes pedidos activos

# activeOrdersDescription
source: Assigned, picked up, and en-route orders will appear here
es: Los pedidos asignados, recogidos y en ruta aparecerán aquí

source: Cannot open navigation
es: No se puede abrir navegación

source: Client phone not available
es: Teléfono del cliente no disponible

# cannotMakeCall
source: Cannot make the call
es: No se puede realizar la llamada

# infoCopied
source: Information copied to clipboard
es: Información copiada al portapapeles

# errorCopyingInfo
source: Error copying information
es: Error al copiar información

source: Error loading orders
es: Error al cargar pedidos

source: Processing delivery...
es: Procesando entrega...

source: Delivery Details
es: Detalles de la Entrega

# orderIdLabel
source: Order ID:
es: ID de Pedido:

# clientLabel
source: Client:
es: Cliente:

# productsCount
source: {count, plural, =1{1 item} other{{count} items}}
es: {count, plural, =1{1 artículo} other{{count} artículos}}

source: Products
es: Productos

source: Proof of Delivery
es: Prueba de Entrega

source: Change Photo
es: Cambiar Foto

source: Delete
es: Eliminar

# noPhotoTaken
source: No photo taken yet
es: Aún no se ha tomado una foto

# takePhotoInstruction
source: Please take a photo of the delivered package.
es: Por favor, tome una foto del paquete entregado.

source: Take Photo
es: Tomar Foto

source: Cancel
es: Cancelar

source: Sign and Deliver
es: Firmar y Entregar

# errorTakingPhoto
source: Error taking photo: {error}
es: Error al tomar foto: {error}

source: Confirm Delivery
es: Confirmar Entrega

# confirmDeliveryQuestion
source: Are you sure you want to confirm the delivery of this order?
es: ¿Estás seguro de que deseas confirmar la entrega de este pedido?

source: Confirm
es: Confirmar

# deliverySuccess
source: Order delivered successfully
es: Pedido entregado exitosamente

# deliveryError
source: Error delivering order: {error}
es: Error al entregar pedido: {error}

source: Edit Delivery Signature
es: Editar Firma de Entrega

source: Delivery Signature
es: Firma de Entrega

source: Sample Signature
es: Firma de Muestra

# mustSignBeforeSaving
source: You must sign before saving
es: Debes firmar antes de guardar

# signatureSuccess
source: {type, select, delivery{Delivery signature generated successfully} sample{Sample signature generated successfully} other{Signature generated successfully}}
es: {type, select, delivery{Firma de entrega generada exitosamente} sample{Firma de muestra generada exitosamente} other{Firma generada exitosamente}}

source: Error saving signature
es: Error al guardar la firma

# profileTitle
source: Profile
es: Perfil

# personalInfo
source: Personal Information
es: Información Personal

# professionalInfo
source: Professional Information
es: Información Profesional

source: System Status
es: Estado del Sistema

source: Security
es: Seguridad

source: Session
es: Sesión

source: Logout
es: Cerrar Sesión

# logoutConfirmation
source: Are you sure you want to logout?
es: ¿Estás seguro de que deseas cerrar sesión?

source: Change profile photo
es: Cambiar foto de perfil

source: Camera
es: Cámara

source: Gallery
es: Galería

source: Delete photo
es: Eliminar foto

# photoUpdateSuccess
source: Profile photo updated
es: Foto de perfil actualizada

# photoUpdateError
source: Error updating photo
es: Error al actualizar la foto

# photoSelectError
source: Error selecting photo
es: Error al seleccionar la foto

source: Change Password
es: Cambiar Contraseña

# changePasswordInstruction
source: Enter your current password and the new password:
es: Ingresa tu contraseña actual y la nueva contraseña:

source: Current Password
es: Contraseña Actual

source: New Password
es: Nueva Contraseña

source: Confirm New Password
es: Confirmar Nueva Contraseña

# minCharacters
source: Minimum 8 characters
es: Mínimo 8 caracteres

# enterCurrentPassword
source: Enter your current password
es: Ingresa tu contraseña actual

# enterNewPassword
source: Enter the new password
es: Ingresa la nueva contraseña

# passwordMinLength
source: The new password must be at least 8 characters long
es: La nueva contraseña debe tener al menos 8 caracteres

source: Passwords do not match
es: Las contraseñas no coinciden

# passwordMustBeDifferent
source: The new password must be different from the current one
es: La nueva contraseña debe ser diferente a la actual

# passwordUpdateSuccess
source: Password updated successfully
es: Contraseña actualizada exitosamente

source: Loading profile...
es: Cargando perfil...

source: Retry
es: Reintentar

source: Name
es: Nombre

source: Phone
es: Teléfono

# driverLicense
source: Driver's License
es: Licencia de Conducir

source: Vehicle
es: Vehículo

source: Driver Status
es: Estado del Repartidor

source: Active User
es: Usuario Activo

source: Not specified
es: No especificado

source: Not assigned
es: No asignado

source: Yes
es: Sí

source: Admin Panel
es: Panel de Admin

# pharmaciesTab
source: Pharmacies
es: Farmacias

# driversTab
source: Drivers
es: Repartidores

# routesTab
source: Routes
es: Rutas

# settingsTab
source: Settings
es: Ajustes

source: Configuration
es: Configuración

# registerDriverTitle
source: Driver Registration
es: Registro de Repartidor

# accountCreatedSuccess
source: Account created successfully. Please sign in.
es: Cuenta creada exitosamente. Ahora inicia sesión.

# errorRegistering
source: Error registering: {error}
es: Error al registrar: {error}

source: Close
es: Cerrar

source: No user authenticated
es: No hay usuario autenticado

source: Retry connection
es: Reintentar conexión

source: Verify connection again
es: Verificar conexión nuevamente

# connectedToServer
source: Connected to server: {url}
es: Conectado al servidor: {url}

source: Obtaining download link...
es: Obteniendo enlace de descarga...

source: Could not get download link
es: No se pudo obtener el enlace de descarga

# downloadStarted
source: Download started successfully
es: Descarga iniciada correctamente

source: Could not open download link
es: No se pudo abrir el enlace de descarga

# errorDownloadingApk
source: Error downloading APK: {error}
es: Error al descargar APK: {error}

# connectionError
source: Connection error: {error}
es: Error de conexión: {error}

# errorLoadingOrdersWithError
source: Error loading orders: {error}
es: Error al cargar los pedidos: {error}

source: Error loading profile
es: Error al cargar perfil

source: Call Client
es: Llamar al Cliente

source: Navigate to pickup
es: Navegar a recogida

source: Navigate to delivery
es: Navegar a entrega

source: Deliver without signature
es: Entregar sin firma

source: All orders loaded
es: Todos los pedidos cargados

# loadingPage
source: Loading page {current} of {total}...
es: Cargando página {current} de {total}...

source: Error deleting photo
es: Error al eliminar la foto

# errorLoadingHistoryWithError
source: Error loading history: {error}
es: Error al cargar el historial: {error}

# orderIdShort
source: Order #
es: Pedido #

# basicInfo
source: Basic Information
es: Información Básica

source: Medications
es: Medicamentos

source: Delivery Address
es: Dirección de Entrega

source: Address
es: Dirección

source: Address Line 2
es: Dirección Línea 2

source: City
es: Ciudad

source: Region
es: Estado/Región

source: Postal Code
es: Código Postal

source: Detail
es: Detalle

source: Access Code
es: Código de Acceso

source: Building Code
es: Código de Edificio

source: Country
es: País

source: Type
es: Tipo

source: Status
es: Estado

source: Priority
es: Prioridad

source: Requires special signature
es: Requiere firma especial

source: Assignment Date
es: Fecha de Asignación

source: Pickup Location
es: Ubicación de Recogida

source: Coordinates
es: Coordenadas

source: Detailed Location
es: Ubicación Detallada

source: Pharmacy
es: Farmacia

source: Pharmacy location
es: Ubicación de la farmacia

source: Driver
es: Repartidor

source: Dates and Progress
es: Fechas y Progreso

source: Pickup Date
es: Fecha de Recogida

source: Delivery Date
es: Fecha de Entrega

source: Created
es: Creado

source: Last Update
es: Última Actualización

source: Estimated Time
es: Tiempo Estimado

source: Estimated Distance
es: Distancia Estimada

source: Observations
es: Observaciones

source: Delivery Proof
es: Comprobantes de Entrega

source: Delivery Photo
es: Foto de Entrega

source: Client Signature
es: Firma del Cliente

source: Consent Document
es: Documento de Consentimiento

# failureInfo
source: Failure Information
es: Información de Fallo

source: Reason
es: Motivo

source: Not found
es: No encontrada

# barcodeTooltip
source: Barcode
es: Código de barras

source: Could not open document
es: No se pudo abrir el documento

# barcodeTitle
source: Barcode
es: Código de Barras

# orderNumber
source: Order #
es: N° PEDIDO

source: Client
es: CLIENTE

source: Location
es: UBICACIÓN

source: Date
es: FECHA

source: Actions
es: ACCIONES

source: No orders to show
es: No hay pedidos para mostrar

source: Assign Driver
es: Asignar Repartidor

source: Edit
es: Editar

source: More options
es: Más opciones

source: Cancel Order
es: Cancelar Pedido

source: Mark as Failed
es: Marcar como Fallido

source: Generate Barcode
es: Generar Código de Barras

source: Not available
es: No disponible

source: Assigned
es: Asignado

# confirmDeliveryTitle
source: Confirm delivery
es: Confirmar entrega

source: Capture signature
es: Capturar firma

# phoneCopied
source: Phone copied to clipboard
es: Teléfono copiado al portapapeles

# emailCopied
source: Email copied to clipboard
es: Email copiado al portapapeles

# clientHasNoEmail
source: Client has no email registered
es: El cliente no tiene email registrado

# couldNotOpenMaps
source: Could not open Google Maps
es: No se puede abrir Google Maps

source: Delivery Status
es: Estado de la Entrega

source: Scheduled deliveries
es: Entregas programadas

source: Navigate to pickup point
es: Navegar a punto de recogida

source: Navigate to delivery point
es: Navegar a punto de entrega

# statusLabel
source: Status:
es: Estado:

source: Details
es: Detalles

# confirmDeliveryWithSignature
source: Do you want to capture the client signature before marking as delivered?
es: ¿Deseas capturar la firma del cliente antes de marcar como entregado?

# errorUpdatingState
source: Error updating state: {error}
es: Error al actualizar estado: {error}

# settingsTitle
source: Settings
es: Configuración

source: Admin Profile
es: Perfil del Administrador

source: Update Profile
es: Actualizar Perfil

# passwordUpdateAvailable
source: Password update available after backend integration.
es: Actualización de contraseña disponible tras la integración con backend.

# couldNotLoadUserInfo
source: Could not load user information
es: No se pudo cargar la información del usuario

# updateProfileButton
source: Update Profile
es: Actualizar Perfil

source: Save
es: Guardar

source: Required
es: Requerido

source: Assign Order
es: Asignar Pedido

source: Assign
es: Asignar

# assignOrderConfirm
source: Assign this order to your delivery list?
es: ¿Asignar este pedido a tu lista de entregas?

# couldNotGetDriverInfo
source: Could not get driver information
es: No se pudo obtener la información del repartidor

# noOrderWithBarcode
source: No order found with this barcode
es: No se encontró ningún pedido con este código de barras

source: Error processing barcode
es: Error al procesar el código de barras

source: Processing barcode...
es: Procesando código de barras...

source: Assigned to:
es: Asignado a:

source: Loading routes...
es: Cargando rutas...

source: All routes
es: Todas las rutas

source: Active routes
es: Rutas activas

source: Completed routes
es: Rutas completadas

source: All drivers
es: Todos los repartidores

source: Unknown driver
es: Repartidor Desconocido

source: Error loading routes
es: Error al cargar rutas

source: Search pharmacies...
es: Buscar farmacias...

source: All statuses
es: Todos los estados

source: Active
es: Activa

source: Inactive
es: Inactiva

source: Suspended
es: Suspendida

source: In Review
es: En Revisión

source: View
es: Ver

# pharmacySavedSuccess
source: Pharmacy saved successfully
es: Farmacia creada exitosamente

# pharmacyUpdatedSuccess
source: Pharmacy updated successfully
es: Farmacia actualizada exitosamente

# errorReloadPharmacies
source: Error reloading pharmacies
es: Error al recargar farmacias

# pharmacySavedButErrorReload
source: Pharmacy saved but error updating list
es: Farmacia guardada pero error al actualizar lista

# pharmacyDeletedSuccess
source: Pharmacy "{name}" deleted successfully
es: Farmacia "{name}" eliminada exitosamente

# errorDeletePharmacy
source: Error deleting pharmacy: {error}
es: Error al eliminar farmacia: {error}

source: No pharmacies found
es: No se encontraron farmacias

source: Error loading pharmacies
es: Error al cargar farmacias

# errorLoadingPharmaciesUnknown
source: Unknown error loading pharmacies
es: Error desconocido al cargar farmacias

# errorLoadingOrdersUnknown
source: Unknown error loading orders
es: Error desconocido al cargar pedidos

# printShippingLabelsTooltip
source: Print Shipping Labels
es: Imprimir Etiquetas de Envío

# uploadCsvTooltip
source: Upload CSV
es: Cargar CSV

# addOrderTooltip
source: Add Order
es: Agregar Pedido

# searchOrdersByClientCodePhone
source: Search by client, code, phone...
es: Buscar por cliente, código, teléfono...

source: Select All
es: Seleccionar Todo

source: Clear Filters
es: Limpiar Filtros

# statesCount
source: {count} states
es: {count} estados

source: No deliveries found
es: No se encontraron entregas

# noOrdersMatchFilters
source: No orders match the applied filters
es: No hay pedidos que coincidan con los filtros aplicados

# showingXOfYOrders
source: Showing {showing} of {total} orders
es: Mostrando {showing} de {total} pedidos

# pageXOfY
source: Page {current} of {total}
es: Página {current} de {total}

# orderBarcodeCaption
source: Order barcode
es: Código de barras del pedido

source: Confirm deletion
es: Confirmar eliminación

# confirmDeleteOrderQuestion
source: Are you sure you want to delete order #{id}?
es: ¿Estás seguro de que deseas eliminar el pedido #{id}?

# deleteOrderIrreversible
source: This action cannot be undone. The order will be permanently deleted.
es: Esta acción no se puede deshacer. El pedido será eliminado permanentemente.

# orderDeletedSuccess
source: Order #{id} deleted successfully
es: Pedido #{id} eliminado exitosamente

# errorDeleteOrder
source: Error deleting order: {error}
es: Error al eliminar pedido: {error}

# errorLoadingDrivers
source: Error loading drivers: {detail}
es: Error al cargar repartidores: {detail}

# selectDriverForOrder
source: Select a driver for the order of {name}
es: Selecciona un repartidor para el pedido de {name}

source: No drivers available
es: No hay repartidores disponibles

# codeLabel
source: Code:
es: Código:

# errorUnknown
source: Unknown error
es: Error desconocido

# confirmCancelOrderQuestion
source: Are you sure you want to cancel order #{id}?
es: ¿Estás seguro de que deseas cancelar el pedido #{id}?

# errorLoadingDriversUnknown
source: Could not load drivers list
es: No se pudo cargar la lista de repartidores

# driverCreatedSuccess
source: Driver created successfully
es: Repartidor creado exitosamente

# driverUpdatedSuccess
source: Driver updated successfully
es: Repartidor actualizado exitosamente

# driverDeletedSuccess
source: Driver "{name}" deleted successfully
es: Repartidor "{name}" eliminado exitosamente

# errorDeleteDriver
source: Error deleting driver: {error}
es: Error al eliminar repartidor: {error}

source: Search drivers...
es: Buscar repartidores...

# noDriversMatchFilters
source: No drivers found with the applied filters
es: No se encontraron repartidores con los filtros aplicados

source: No drivers registered
es: No hay repartidores registrados

source: Add Driver
es: Agregar Repartidor

source: Deactivated drivers ({count})
es: Repartidores desactivados ({count})

# driverLabel
source: Driver
es: Repartidor

source: Driver phone not available
es: Teléfono del repartidor no disponible

source: Error making call
es: Error al realizar la llamada

# lastActivityNoActivity
source: no activity
es: sin actividad

# lastActivityJustNow
source: just now
es: justo ahora

# lastActivityMinutesAgo
source: {count} min ago
es: hace {count} min

# lastActivityHoursAgo
source: {count} h ago
es: hace {count} h

# lastActivityDaysAgo
source: {count} d ago
es: hace {count} d

# enterValidName
source: Enter a valid name.
es: Ingresa un nombre válido.

# nameMinLength3
source: Name must be at least 3 characters.
es: El nombre debe tener al menos 3 caracteres.

# enterEmailAddress
source: Enter an email address.
es: Ingresa una dirección de correo.

source: Invalid email.
es: Correo inválido.

# enterValidPhone
source: Enter a valid phone number.
es: Ingresa un teléfono válido.

# repeatNewPassword
source: Repeat the new password
es: Repite la nueva contraseña

# confirmPasswordRequired
source: Confirm the new password.
es: Confirma la nueva contraseña.

# newPasswordMin12
source: Use at least 12 characters.
es: Usa al menos 12 caracteres.

# passwordMustIncludeComplexity
source: Must include uppercase, lowercase and numbers.
es: Debe incluir mayúsculas, minúsculas y números.

source: Update password
es: Actualizar contraseña

# tableHeaderPhoto
source: PHOTO
es: FOTO

# tableHeaderName
source: NAME
es: NOMBRE

# tableHeaderPhone
source: PHONE
es: TELÉFONO

# tableHeaderVehicle
source: VEHICLE
es: VEHÍCULO

# tableHeaderLastActivity
source: LAST ACTIVITY
es: ÚLTIMA ACTIVIDAD

source: No drivers to show
es: No hay repartidores para mostrar

# viewDetailsTooltip
source: View details
es: Ver detalles

source: Copy Email
es: Copiar Email

# confirmDeleteDriverQuestion
source: Are you sure you want to delete driver "{name}"?
es: ¿Estás seguro de que deseas eliminar al repartidor "{name}"?

# deleteDriverIrreversible
source: This action cannot be undone. The driver will be permanently deleted.
es: Esta acción no se puede deshacer. El repartidor será eliminado permanentemente.

# cannotOpenCallApp
source: Could not open phone app
es: No se pudo abrir la aplicación de llamadas

# errorMakingCallWithError
source: Error making call: {error}
es: Error al realizar la llamada: {error}

source: No email available
es: No hay email disponible

# errorCopyingEmail
source: Error copying email: {error}
es: Error al copiar el email: {error}

# changePasswordTitle
source: Change password
es: Cambiar contraseña

# requiredField
source: Required
es: Requerido

# min6Characters
source: Minimum 6 characters
es: Mínimo 6 caracteres

# passwordsDoNotMatchShort
source: Do not match
es: No coinciden

source: Password updated
es: Contraseña actualizada

source: Could not update password
es: No se pudo actualizar la contraseña

# errorSavingDriver
source: Error saving: {error}
es: Error al guardar: {error}

# errorSavingDriverUnknown
source: Unknown error saving driver
es: Error desconocido al guardar repartidor

source: Select expiry date
es: Seleccionar fecha de vencimiento

# errorSelectingDate
source: Error selecting date: {error}
es: Error al seleccionar fecha: {error}

# phoneNumberLabel
source: Phone Number
es: Número de Teléfono

# phoneMustBe10Digits
source: Phone must be exactly 10 digits
es: El teléfono debe tener exactamente 10 dígitos

source: Edit Driver
es: Editar Repartidor

source: New Driver
es: Nuevo Repartidor

source: Modifying driver
es: Modificando repartidor

# creatingDriver
source: Creating new driver
es: Creando nuevo repartidor

# sectionPersonalInfo
source: Personal Information
es: Información Personal

# sectionLicenseInfo
source: License Information
es: Información de Licencia

# sectionVehicleInfo
source: Vehicle Information
es: Información del Vehículo

# sectionDocuments
source: Documents and Photos
es: Documentos y Fotos

# sectionSettings
source: Settings
es: Configuración

# fullNameRequired
source: Full Name *
es: Nombre Completo *

# nameRequired
source: Name is required
es: El nombre es requerido

# emailRequired
source: Email is required
es: El email es requerido

# countryDefaultUSA
source: Will be sent as USA by default
es: Se enviará como USA por defecto

# passwordRequired
source: Password is required
es: La contraseña es requerida

# passwordMin6Chars
source: Password must be at least 6 characters
es: La contraseña debe tener al menos 6 caracteres

# idDriverLicenseLabel
source: ID (Driver's License or State ID)
es: ID (Driver's License o State ID)

# idHelper
source: Letters and numbers; no spaces or hyphens
es: Letras y números; sin espacios ni guiones

# idMin5Chars
source: ID must be at least 5 characters
es: El ID debe tener al menos 5 caracteres

# alphanumericOnly
source: Letters and numbers only
es: Solo letras y números

# licenseNumberLabel
source: License Number
es: Número de Licencia

# licenseFormatHelper
source: Format: Letters and numbers
es: Formato: Letras y números

# licenseMin5Chars
source: License number must be at least 5 characters
es: El número de licencia debe tener al menos 5 caracteres

# uppercaseAndNumbersOnly
source: Uppercase letters and numbers only
es: Solo letras mayúsculas y números

# licenseExpiryLabel
source: License Expiry
es: Vencimiento de Licencia

source: Select date
es: Seleccionar fecha

# vehiclePlateLabel
source: Vehicle Plate
es: Placa del Vehículo

# vehiclePlateFormat
source: Format: ABC-123 or ABC123
es: Formato: ABC-123 o ABC123

# plateMin4Chars
source: Plate must be at least 4 characters
es: La placa debe tener al menos 4 caracteres

# uppercaseNumbersDashes
source: Uppercase letters, numbers and hyphens only
es: Solo letras mayúsculas, números y guiones

# vehicleBrandLabel
source: Vehicle Brand
es: Marca del Vehículo

# vehicleBrandHelper
source: E.g.: Toyota, Honda, Ford
es: Ej: Toyota, Honda, Ford

# brandMin2Chars
source: Brand must be at least 2 characters
es: La marca debe tener al menos 2 caracteres

source: Letters and spaces only
es: Solo letras y espacios

# vehicleModelLabel
source: Vehicle Model
es: Modelo del Vehículo

# vehicleModelHelper
source: E.g.: Corolla, Civic, Focus
es: Ej: Corolla, Civic, Focus

# modelMin2Chars
source: Model must be at least 2 characters
es: El modelo debe tener al menos 2 caracteres
