Repository: DiegoAlessandroMotta/medrush-app
Catalog: frontend/lib/l10n/app_*.arb
Languages: es

source: User disabled
es: Usuario deshabilitado

source: Could not update active status
es: No se pudo actualizar estado activo

# updateLabel
source: Update
es: Actualizar

source: Create Driver
es: Crear Repartidor

source: Tap to select
es: Toca para seleccionar

# driverPhotoPlaceholder
source: Driver photo
es: Foto del repartidor

# errorUploadingImage
source: Error uploading image: {error}
es: Error al subir imagen: {error}

# locationLabel
source: Location
es: Ubicación

source: Error getting address
es: Error al obtener dirección

# tapMapToSelectLocation
source: Tap the map to select a location
es: Toca el mapa para seleccionar una ubicación

# centerButton
source: Center
es: Centrar

# confirmButton
source: Confirm
es: Confirmar

# barcodeCodeCopied
source: Code copied to clipboard
es: Código copiado al portapapeles

# copyCodeTooltip
source: Copy code
es: Copiar código

# regenerateButton
source: Regenerate
es: Regenerar

# alphanumericLabel
source: Alphanumeric
es: Alfanumérico

# numericLabel
source: Numeric
es: Numérico

source: Error generating barcode
es: Error al generar código de barras

source: Error loading image
es: Error al cargar imagen

source: Server response error
es: Error en la respuesta del servidor

source: Error logging out
es: Error al cerrar sesión

source: Error updating profile
es: Error al actualizar perfil

source: Select a pharmacy
es: Selecciona una farmacia

source: Central Pharmacy
es: Farmacia Central

source: Clear CSV
es: Limpiar CSV

# orderTypeMedicalSupplies
source: Medical Supplies
es: Insumos Médicos

# orderTypeMedicalEquipment
source: Medical Equipment
es: Equipos Médicos

# orderTypeControlledMedications
source: Controlled Medications
es: Medicamentos Controlados

source: Invalid code
es: Código inválido

# driverAssignedSuccess
source: Driver {name} assigned successfully
es: Repartidor {name} asignado exitosamente

# orderCanceledSuccess
source: Order #{id} canceled successfully
es: Pedido #{id} cancelado exitosamente

# errorCancelingOrder
source: Error canceling order: {detail}
es: Error al cancelar pedido: {detail}

# orderMarkedFailedSuccess
source: Order #{id} marked as failed
es: Pedido #{id} marcado como fallido

# errorMarkingOrderFailed
source: Error marking order as failed: {detail}
es: Error al marcar pedido como fallido: {detail}

# defaultSchedulePlaceholder
source: Mon-Fri: 8:00-20:00
es: Lun-Vie: 8:00-20:00

# orderAssignedSuccess
source: Order assigned successfully
es: Pedido asignado exitosamente

source: Error assigning order: {detail}
es: Error al asignar pedido: {detail}

source: Order delivered
es: Pedido entregado

source: Order failed
es: Pedido fallido

# orderCancelledStatus
source: Order cancelled
es: Pedido cancelado

source: Re-optimize route
es: Re-optimizar ruta

source: In Queue
es: En Cola

source: Pick up at:
es: Recoger en:

source: Route not available
es: Ruta no disponible

source: to pickup
es: a recogida

source: to delivery
es: a entrega

# completedStatus
source: completed
es: completado

# pickupLabel
source: Pick up:
es: Recoger:

source: Client Information
es: Información del Cliente

# copyPhoneTooltip
source: Copy phone
es: Copiar teléfono

# districtLabel
source: District
es: Distrito

source: View Map
es: Ver Mapa

source: No chain
es: Sin cadena

# orderTypeSectionTitle
source: Order Type
es: Tipo de Pedido

# orderTypeLabel
source: Order type
es: Tipo de pedido

source: Signature Captured
es: Firma Capturada

source: Delivery not found
es: Entrega no encontrada

# deliveryNotFoundWithId
source: Delivery #{id} does not exist
es: La entrega #{id} no existe

source: Picked up
es: Recogido

# deliveredStatus
source: Delivered
es: Entregado

source: No signature available
es: No hay firma disponible

source: Error loading signature
es: Error al cargar firma

source: Error rendering SVG
es: Error al renderizar SVG

source: Error decoding signature
es: Error al decodificar firma

source: Invalid signature format
es: Formato de firma inválido

source: On Route
es: En Ruta

source: Next
es: Siguiente

# pickUpAction
source: Pick up
es: Recoger

# filterDelivered
source: Delivered
es: Entregados

# filterCancelled
source: Cancelled
es: Cancelados

# filterFailed
source: Failed
es: Fallidos

source: Profile photo updated
es: Foto de perfil actualizada

source: Profile photo deleted
es: Foto de perfil eliminada

# confirmDeleteProfilePhotoQuestion
source: Are you sure you want to delete your profile photo?
es: ¿Estás seguro de que deseas eliminar tu foto de perfil?

# securitySectionTitle
source: Security
es: Seguridad

# changeButton
source: Change
es: Cambiar

# min8Characters
source: Minimum 8 characters
es: Mínimo 8 caracteres

# newPasswordMin8Chars
source: The new password must be at least 8 characters
es: La nueva contraseña debe tener al menos 8 caracteres

# passwordChangedSuccess
source: Password updated successfully
es: Contraseña actualizada exitosamente

# errorChangingPassword
source: Error changing password: {detail}
es: Error al cambiar contraseña: {detail}

# errorChangingPasswordShort
source: Error changing password
es: Error al cambiar contraseña

source: Active sessions
es: Sesiones activas

# drivingLicense
source: Driver's License
es: Licencia de Conducir

# errorLoadingHistory
source: Unknown error loading history
es: Error desconocido al cargar historial

# orderIdShortLabel
source: Order ID:
es: Pedido ID:

# pharmacyIdLabel
source: Pharmacy ID:
es: Farmacia ID:

# copyButton
source: Copy
es: Copiar

# formatNumericDigits
source: Numeric format ({count} digits)
es: Formato numérico ({count} dígitos)

# formatAlphanumericChars
source: Alphanumeric format ({count} characters)
es: Formato alfanumérico ({count} caracteres)

# selectedLocationLabel
source: Selected location:
es: Ubicación seleccionada:

# exitButton
source: Exit
es: Salir

# invalidCoordinatesFormat
source: Invalid coordinates format. Use: "latitude, longitude"
es: Formato de coordenadas no válido. Use: "latitud, longitud"

source: View Driver
es: Ver Repartidor

# optimizeRoutesTitle
source: Optimize Routes
es: Optimizar Rutas

# optimizeButton
source: Optimize
es: Optimizar

# pharmacyDetailsTitle
source: Pharmacy Details
es: Detalles de Farmacia

# cameraPermissionTitle
source: Camera Permission
es: Permiso de Cámara

# settingsButton
source: Settings
es: Configuración

source: Code Scanned
es: Código Escaneado

source: Scan Another
es: Escanear Otro

source: Allow Camera Access
es: Permitir Acceso a Cámara

# changeOrderTitle
source: Change order - Order #{id}
es: Cambiar orden - Pedido #{id}

# patientLabel
source: Patient:
es: Paciente:

source: Reload route
es: Recargar ruta

source: View deliveries ({count})
es: Ver entregas ({count})

source: Revoke
es: Revocar

source: My Location
es: Mi Ubicación

# deliveryMarkerTitle
source: {order}) Delivery - {name}
es: {order}) Entrega - {name}

# pickedUpCount
source: Picked up
es: Recogido

# pickUpCount
source: Pick up
es: Recoger

# optimizeRoutesConfirmation
source: Are you sure you want to optimize all routes? This process may take several minutes.
es: ¿Estás seguro de que quieres optimizar todas las rutas? Este proceso puede tomar varios minutos.

# cameraPermissionContent
source: The app needs camera access to scan barcodes.
es: La aplicación necesita acceso a la cámara para escanear códigos de barras.

source: Camera Permission Required
es: Permiso de Cámara Requerido

# cameraPermissionBody
source: To scan barcodes, we need access to your camera.
es: Para escanear códigos de barras, necesitamos acceso a tu cámara.

# scanTitleWithMode
source: Scan - {mode}
es: Escanear - {mode}

# modeLabel
source: Mode:
es: Modo:

# orderNumberLabel
source: Order:
es: Pedido:

# successDeliveryVerified
source: Delivery code verified successfully
es: Código de entrega verificado correctamente

# successPickupVerified
source: Pickup code verified successfully
es: Código de recogida verificado correctamente

# successVerified
source: Code verified successfully
es: Código verificado correctamente

# successScanned
source: Code scanned successfully
es: Código escaneado correctamente

# switchCameraTooltip
source: Switch Camera
es: Cambiar Cámara

# currentLocationLabel
source: Current location
es: Ubicación actual

# pickupMarkerTitle
source: {order}) Pickup - {name}
es: {order}) Recogida - {name}

# pickupMarkerTitleWithCount
source: Pickup ({count} pending)
es: Recogida ({count} pendientes)

# pickupPointLabel
source: Pickup point
es: Punto de recogida

# pendingLabel
source: Pending:
es: Pendientes:

# pickedUpLabel
source: Picked up:
es: Recogidos:

# addressLabel
source: Address:
es: Dirección:

source: No pickup location available
es: No hay ubicación de recogida disponible

source: No delivery location available
es: No hay ubicación de entrega disponible

source: No valid location to navigate
es: No hay ubicación válida para navegar

# orderProcessed
source: This order has already been processed
es: Este pedido ya fue procesado

source: Error loading map
es: Error al cargar el mapa

# networkConfigTitle
source: Network Configuration
es: Configuración de Red

# routeMapTitle
source: Route Map:
es: Mapa de Ruta:

source: Start Point
es: Punto de Inicio

source: Route start
es: Inicio de la ruta

source: End Point
es: Punto Final

source: Route end
es: Final de la ruta

source: Patient
es: Paciente

# orderNumberPrefix
source: Order #
es: Pedido #

source: Center map
es: Centrar mapa

source: Legend:
es: Leyenda:

source: Start
es: Inicio

source: End
es: Final

source: Orders
es: Pedidos

# appTitle
source: MedRush - Medicine Delivery
es: MedRush - Delivery de Medicamentos

# statusPending
source: Pending
es: Pendiente

# statusAssigned
source: Assigned
es: Asignado

# statusPickedUp
source: Picked up
es: Recogido

# statusInRoute
source: In Route
es: En Ruta

# statusDelivered
source: Delivered
es: Entregado

# statusFailed
source: Failed
es: Fallido

# statusCancelled
source: Cancelled
es: Cancelado

# orderTypeMedicines
source: Medicines
es: Medicamentos

# orderTypeControlledMedicines
source: Controlled Medicines
es: Medicamentos Controlados

# driverStatusAvailable
source: Available
es: Disponible

# driverStatusInRoute
source: In Route
es: En Ruta

# driverStatusDisconnected
source: Disconnected
es: Desconectado

# pharmacyStatusActive
source: Active
es: Activa

# pharmacyStatusInactive
source: Inactive
es: Inactiva

# pharmacyStatusSuspended
source: Suspended
es: Suspendida

# pharmacyStatusUnderReview
source: Under Review
es: En Revisión

# failureReasonClientNotFound
source: Client not found
es: Cliente no se encontraba

# failureReasonWrongAddress
source: Wrong address
es: Dirección incorrecta

# failureReasonNoCalls
source: No calls received
es: No recibió llamadas

# failureReasonDeliveryRejected
source: Delivery rejected
es: Rechazó la entrega

# failureReasonAccessDenied
source: Access denied
es: Acceso denegado

# failureReasonOther
source: Other reason
es: Otro motivo

source: Today
es: Hoy

source: Tomorrow
es: Mañana

source: Yesterday
es: Ayer

source: Monday
es: Lunes

source: Tuesday
es: Martes

source: Wednesday
es: Miércoles

source: Thursday
es: Jueves

source: Friday
es: Viernes

source: Saturday
es: Sábado

source: Sunday
es: Domingo

source: ago
es: hace

# inTime
source: in
es: en

source: minutes
es: minutos

source: hour
es: hora

source: hours
es: horas

source: day
es: día

source: days
es: días

source: month
es: mes

source: months
es: meses

source: year
es: año

source: years
es: años

# dateTypeDelivery
source: Delivery
es: Entrega

# dateTypePickup
source: Pickup
es: Recogida

# dateTypeAssignment
source: Assignment
es: Asignación

source: No date
es: Sin fecha

source: Recently assigned
es: Recién asignado

source: Recently picked up
es: Recién recogido

source: In route
es: En ruta

source: Recently delivered
es: Recién entregado

source: Delivery failed
es: Entrega fallida

source: Invalid time
es: Tiempo inválido

source: Address not specified
es: Dirección no especificada

source: City not specified
es: Ciudad no especificada

source: In Progress
es: En Progreso

# notificationOrderStatusUpdated
source: Order Status Updated
es: Estado del Pedido Actualizado

# notificationOrderAssigned
source: Order {code} has been assigned to a delivery driver
es: El pedido {code} ha sido asignado a un repartidor

# notificationOrderPickedUp
source: Order {code} has been picked up by the delivery driver
es: El pedido {code} ha sido recogido por el repartidor

# notificationOrderInRoute
source: Order {code} is on route to its destination
es: El pedido {code} está en ruta hacia su destino

# notificationOrderDelivered
source: Order {code} has been delivered successfully
es: El pedido {code} ha sido entregado exitosamente

# notificationOrderFailed
source: Delivery of order {code} has failed
es: La entrega del pedido {code} ha fallado

# notificationOrderCancelled
source: Order {code} has been cancelled
es: El pedido {code} ha sido cancelado

# notificationOrderStatusChanged
source: Order {code} status changed from {oldStatus} to {newStatus}
es: El estado del pedido {code} ha cambiado de {oldStatus} a {newStatus}

# notificationDriverStatusUpdated
source: Driver Status Updated
es: Estado del Repartidor Actualizado

# notificationDriverStatusChanged
source: Driver {name} changed status from {oldStatus} to {newStatus}
es: El repartidor {name} cambió de estado de {oldStatus} a {newStatus}

# notificationPharmacyStatusUpdated
source: Pharmacy Status Updated
es: Estado de la Farmacia Actualizado

# notificationPharmacyStatusChanged
source: Pharmacy {name} changed status from {oldStatus} to {newStatus}
es: La farmacia {name} cambió de estado de {oldStatus} a {newStatus}

# userTypeAdministrator
source: Administrator
es: Administrador

# userTypeDriver
source: Driver
es: Repartidor

source: No data
es: Sin datos

source: No pages
es: Sin páginas

# eventTypeCreated
source: Created
es: Creado

# eventTypeAssigned
source: Assigned
es: Asignado

# eventTypePickedUp
source: Picked Up
es: Recogido

# eventTypeInRoute
source: In Route
es: En Ruta

# eventTypeDelivered
source: Delivered
es: Entregado

# eventTypeFailed
source: Delivery Failed
es: Entrega Fallida

# eventTypeCancelled
source: Cancelled
es: Cancelado

# eventTypeRescheduled
source: Rescheduled
es: Reagendado

# eventTypeOrderCreated
source: Order Created
es: Pedido Creado

# eventTypeOrderAssigned
source: Order Assigned
es: Pedido Asignado

# eventTypeRouteOptimized
source: Route Optimized
es: Ruta Optimizada

# eventTypeLocationUpdated
source: Location Updated
es: Ubicación Actualizada

# eventTypeDriverConnected
source: Driver Connected
es: Repartidor Conectado

# eventTypeDriverDisconnected
source: Driver Disconnected
es: Repartidor Desconectado

# eventTypePharmacyConnected
source: Pharmacy Connected
es: Farmacia Conectada

# eventTypePharmacyDisconnected
source: Pharmacy Disconnected
es: Farmacia Desconectada

# eventTypeNotificationSent
source: Notification Sent
es: Notificación Enviada

# signatureTypeFirstTime
source: First Time
es: Primera Vez

# signatureTypeReception
source: Reception
es: Recepción

# signatureTypeControlledMedicine
source: Controlled Medicine
es: Medicamento Controlado

# signatureTypeAuthorization
source: Authorization
es: Autorización

# signatureDescriptionFirstTime
source: Initial patient signature to authorize the service
es: Firma inicial del paciente para autorizar el servicio

# signatureDescriptionReception
source: Signature confirming receipt of the order
es: Firma de confirmación de recepción del pedido

# signatureDescriptionControlledMedicine
source: Special signature required for controlled medicines
es: Firma especial requerida para medicamentos controlados

# signatureDescriptionAuthorization
source: Authorization signature for the delivery service
es: Firma de autorización para el servicio de delivery

# defaultCity
source: City
es: Ciudad
