Repository: DiegoAlessandroMotta/medrush-app
Catalog: frontend/lib/l10n/app_*.arb
Languages: es

# alphanumericSpacesDashes
source: Letters, numbers, spaces and hyphens only
es: Solo letras, números, espacios y guiones

# vehicleRegistrationLabel
source: Vehicle Registration Code
es: Código de Registro del Vehículo

# vehicleRegistrationHelper
source: Alphanumeric; e.g.: ABC123456
es: Alfanumérico; ej: ABC123456

# min5Characters
source: Must be at least 5 characters
es: Debe tener al menos 5 caracteres

# photoIdTitle
source: ID Photo
es: Foto de ID

# photoIdSubtitle
source: Identity document
es: Documento de identidad

# photoLicenseTitle
source: Driver's License Photo
es: Foto de Licencia de Conducir

# photoLicenseSubtitle
source: Valid driver's license
es: Licencia de conducir vigente

# photoInsuranceTitle
source: Vehicle Insurance Photo
es: Foto de Seguro del Vehículo

# photoInsuranceSubtitle
source: Valid policy
es: Póliza vigente

# stateRequired
source: Status *
es: Estado *

# userTypeLabel
source: User Type
es: Tipo de Usuario

# verifiedLabel
source: Verified
es: Verificado

# documentsSection
source: Documents
es: Documentos

# loadingPharmacyInfo
source: Loading pharmacy information...
es: Cargando información de la farmacia...

source: Not assigned to any pharmacy
es: No asignado a ninguna farmacia

# profilePhotoTitle
source: Profile photo
es: Foto de perfil

# documentTitle
source: Document
es: Documento

# adminRole
source: Administrator
es: Administrador

# driverRole
source: Driver
es: Repartidor

# pharmacyAssignmentSection
source: Pharmacy Assignment
es: Asignación de Farmacia

# systemInfoSection
source: System Information
es: Información del Sistema

# registrationDateLabel
source: Registration Date
es: Fecha de Registro

# lastActivityLabel
source: Last Activity
es: Última Actividad

# expiryLabel
source: Expiry
es: Vencimiento

# photoIdLabel
source: ID Photo
es: Foto ID

# photoLicenseLabel
source: License Photo
es: Foto Licencia

# digitalSignatureLabel
source: Digital Signature
es: Firma Digital

# pharmacyDetailTitle
source: Pharmacy Detail
es: Detalle de Farmacia

# generalInfoTitle
source: General Information
es: Información General

# locationTitle
source: Location
es: Ubicación

# contactTitle
source: Contact
es: Contacto

# additionalInfoTitle
source: Additional Information
es: Información Adicional

# responsibleLabel
source: Responsible
es: Responsable

# responsiblePhoneLabel
source: Responsible Phone
es: Teléfono Responsable

# latitudeLabel
source: Latitude
es: Latitud

# longitudeLabel
source: Longitude
es: Longitud

# scheduleLabel
source: Schedule
es: Horario

# registrationDateShort
source: Registration Date
es: Fecha Registro

# pharmacyLocationTitle
source: Location of {name}
es: Ubicación de {name}

# razonSocialLabel
source: Legal Name
es: Razón Social

# cadenaLabel
source: Chain
es: Cadena

# stateRegionLabel
source: State
es: Estado

# lastUpdateLabel
source: Last Update
es: Última Actualización

# statusShort
source: Status
es: Estado

# selectPharmacyLocationTitle
source: Select Pharmacy Location
es: Seleccionar Ubicación de la Farmacia

source: Updating pharmacy...
es: Actualizando farmacia...

source: Creating pharmacy...
es: Creando farmacia...

source: Error updating pharmacy
es: Error al actualizar farmacia

source: Error creating pharmacy
es: Error al crear farmacia

source: Error deleting pharmacy
es: Error al eliminar farmacia

# pleaseEnterPharmacyName
source: Please enter the pharmacy name
es: Por favor ingrese el nombre de la farmacia

# pleaseEnterResponsible
source: Please enter the responsible person
es: Por favor ingrese el responsable

# pleaseEnterPhone
source: Please enter the phone number
es: Por favor ingrese el teléfono

# pleaseEnterValidEmail
source: Please enter a valid email
es: Por favor ingrese un correo válido

# pleaseEnterRuc
source: Please enter the RUC
es: Por favor ingrese el RUC

# pharmacyStatusTitle
source: Pharmacy Status
es: Estado de la Farmacia

source: Available
es: Disponible

# pleaseEnterCity
source: Please enter the city
es: Por favor ingrese la ciudad

source: Edit Pharmacy
es: Editar Farmacia

source: New Pharmacy
es: Nueva Farmacia

# mapLocationTitle
source: Map location
es: Ubicación en el mapa

# geocodingErrorMap
source: Geocoding error on small map
es: Error en geocodificación del mapa pequeño

# pleaseEnterLatitude
source: Please enter the latitude
es: Por favor ingrese la latitud

# pleaseEnterValidLatitude
source: Please enter a valid latitude
es: Por favor ingrese una latitud válida

# pleaseEnterLongitude
source: Please enter the longitude
es: Por favor ingrese la longitud

# pleaseEnterValidLongitude
source: Please enter a valid longitude
es: Por favor ingrese una longitud válida

source: Update Pharmacy
es: Actualizar Farmacia

source: Create Pharmacy
es: Crear Farmacia

# confirmDeletePharmacyQuestion
source: Are you sure you want to delete pharmacy "{name}"? This action cannot be undone.
es: ¿Estás seguro de que deseas eliminar la farmacia "{name}"? Esta acción no se puede deshacer.

# pharmacyNameLabel
source: Pharmacy Name *
es: Nombre de la Farmacia *

# chainOptionalLabel
source: Chain (optional)
es: Cadena (opcional)

# responsibleRequiredLabel
source: Responsible *
es: Responsable *

# responsiblePhoneOptionalLabel
source: Responsible Phone (optional)
es: Teléfono del Responsable (opcional)

# phoneRequiredLabel
source: Phone *
es: Teléfono *

# emailOptionalLabel
source: Email (optional)
es: Correo Electrónico (opcional)

# cityRequiredLabel
source: City *
es: Ciudad *

# zipOptionalLabel
source: ZIP Code (optional)
es: ZIP Code (opcional)

# scheduleOptionalLabel
source: Schedule (optional)
es: Horario de Atención (opcional)

# delivery24hHoursLabel
source: Delivery 24 hours
es: Delivery 24 horas

# addressLine1RequiredLabel
source: Address Line 1 *
es: Dirección Línea 1 *

# addressLine2OptionalLabel
source: Address Line 2 (optional)
es: Dirección Línea 2 (opcional)

source: Please enter address line 1
es: Por favor ingrese la dirección línea 1

# addressLine1HelperText
source: Street, avenue, etc.
es: Calle, avenida, jirón, etc.

# addressLine2HelperText
source: Floor, apartment, reference, etc.
es: Piso, departamento, referencia, etc.

# deletePharmacyIrreversible
source: This action cannot be undone. The pharmacy will be permanently deleted.
es: Esta acción no se puede deshacer. La farmacia será eliminada permanentemente.

# confirmDeletePharmacyQuestionShort
source: Are you sure you want to delete pharmacy "{name}"?
es: ¿Estás seguro de que deseas eliminar la farmacia "{name}"?

# latitudeRequiredLabel
source: Latitude *
es: Latitud *

# longitudeRequiredLabel
source: Longitude *
es: Longitud *

source: Saving...
es: Guardando...

# barcodeLabel
source: Barcode
es: Código de Barras

# assignDriverTitle
source: Assign Driver
es: Asignar Repartidor

source: No active drivers
es: No hay repartidores activos

source: Confirm Assignment
es: Confirmar Asignación

# cancelOrderTitle
source: Cancel Order
es: Cancelar Pedido

source: Confirm Cancellation
es: Confirmar Cancelación

# markAsFailedTitle
source: Mark as Failed
es: Marcar como Fallido

# failureReasonLabel
source: Failure reason
es: Motivo del fallo

# observationsOptionalLabel
source: Observations (optional)
es: Observaciones (opcional)

# failureDetailsHint
source: Additional details about the failure...
es: Detalles adicionales sobre el fallo...

source: Confirm Failure
es: Confirmar Fallo

# barcodeOrderDescription
source: Order barcode
es: Código de barras del pedido

source: Error deleting order
es: Error al eliminar pedido

# orderCancelledSuccess
source: Order #{id} cancelled successfully
es: Pedido #{id} cancelado exitosamente

source: Error cancelling order
es: Error al cancelar pedido

# cancelOrderIrreversible
source: This action will change the order status to "Cancelled" and cannot be undone.
es: Esta acción cambiará el estado del pedido a "Cancelado" y no se podrá revertir.

# selectFailureReasonForOrder
source: Select the failure reason for order #{id}
es: Selecciona el motivo del fallo para el pedido #{id}

# markAsFailedIrreversible
source: This action will change the order status to "Failed" and will record the current location.
es: Esta acción cambiará el estado del pedido a "Fallido" y registrará la ubicación actual.

# stateOptionalLabel
source: State (optional)
es: Estado (opcional)

# districtRequiredLabel
source: District *
es: Distrito *

# postalCodeOptionalLabel
source: Postal Code (optional)
es: Código Postal (opcional)

# deliveryAddressLine1Label
source: Delivery Address Line 1 *
es: Dirección de Entrega Línea 1 *

# deliveryAddressLine2OptionalLabel
source: Delivery Address Line 2 (optional)
es: Dirección de Entrega Línea 2 (opcional)

source: Add
es: Agregar

# driverOptionalLabel
source: Driver (optional)
es: Repartidor (opcional)

source: Loading drivers...
es: Cargando repartidores...

source: Unassigned
es: Sin asignar

# pharmacyRequiredLabel
source: Pharmacy *
es: Farmacia *

source: Loading pharmacies...
es: Cargando farmacias...

# clientNameRequiredLabel
source: Client Name *
es: Nombre del Cliente *

# buildingAccessCodeOptionalLabel
source: Building Access Code (optional)
es: Código de Acceso al Edificio (opcional)

# orderTypeRequiredLabel
source: Order Type *
es: Tipo de Pedido *

# addMedicationTitle
source: Add Medication
es: Agregar Medicamento

# medicationNameRequiredLabel
source: Medication Name *
es: Nombre del Medicamento *

# quantityRequiredLabel
source: Quantity *
es: Cantidad *

# selectDriverTitle
source: Select Driver
es: Seleccionar Repartidor

# searchDriverHint
source: Search by name, phone or email...
es: Buscar por nombre, teléfono o email...

# unassignDriverOption
source: Do not assign driver to this order
es: No asignar repartidor a este pedido

source: Select
es: Seleccionar

# selectDeliveryLocationTitle
source: Select Delivery Location
es: Seleccionar Ubicación de Entrega

# noMedicationsAddedHint
source: No medications added. Press "Add" to add medications.
es: No hay medicamentos agregados. Presiona "Agregar" para añadir medicamentos.

# routeDetailsTitle
source: Route Details
es: Detalles de la Ruta

source: No name
es: Sin nombre

source: Completed
es: Completada

source: Unknown
es: Desconocido

# distanceLabel
source: Distance
es: Distancia

# estimatedTimeLabel
source: Estimated Time
es: Tiempo Estimado

# additionalDetailsLabel
source: Additional details
es: Detalles adicionales

# startPointLabel
source: Start Point
es: Punto de Inicio

# endPointLabel
source: End Point
es: Punto Final

# creationDateLabel
source: Creation Date
es: Fecha de Creación

# routeOrdersTitle
source: Route Orders
es: Pedidos de la Ruta

# refreshOrdersTooltip
source: Refresh orders
es: Refrescar pedidos

source: Client not specified
es: Cliente no especificado

# oldOrdersCleanupTitle
source: Old Orders File Cleanup
es: Limpieza de Archivos de Pedidos Antiguos

# oldOrdersCleanupDescription
source: This action will permanently delete only multimedia files (delivery photos and digital signatures) from orders delivered more than the selected time ago. Order data will remain intact.
es: Esta acción eliminará permanentemente solo los archivos multimedia (fotos de entrega y firmas digitales) de pedidos entregados hace más del tiempo seleccionado. Los datos del pedido se mantendrán intactos.

# weeksBackLabel
source: Weeks back
es: Semanas hacia atrás

source: Processing...
es: Procesando...

source: Save Configuration
es: Guardar Configuración

source: Confirm Cleanup
es: Confirmar Limpieza

# confirmCleanupDescription
source: This action will permanently delete only multimedia files (photos and signatures). Order data will remain intact.
es: Esta acción eliminará permanentemente solo los archivos multimedia (fotos y firmas). Los datos del pedido se mantendrán intactos.

# cleanupStartedSuccess
source: Multimedia file cleanup for old orders has been started successfully
es: La limpieza de archivos multimedia de pedidos antiguos ha sido iniciada exitosamente

source: Error starting cleanup
es: Error al iniciar la limpieza

# googleApiUsageTitle
source: Google API Usage
es: Uso de Google API

# refreshMetricsTooltip
source: Refresh metrics
es: Actualizar métricas

source: API Calls (Last 30 days)
es: Llamadas API (Últimos 30 días)

source: Error loading metrics
es: Error al cargar las métricas

# requestsLabel
source: Requests
es: Solicitudes

# servicesLabel
source: Services
es: Servicios

source: Cost per request
es: Costo por solicitud

source: Total cost
es: Costo total

source: No usage data available
es: No hay datos de uso disponibles

# metricsWillAppearWhenRequests
source: Metrics will appear when API requests are made
es: Las métricas aparecerán cuando se realicen solicitudes a la API

# periodLabel
source: Period
es: Período

# weekLabel
source: week
es: semana

# weeksLabel
source: weeks
es: semanas

# confirmCleanupWeeksQuestion
source: Are you sure you want to delete only multimedia files (photos and signatures) from orders delivered more than {count} {weeksLabel} ago?
es: ¿Estás seguro de que deseas eliminar solo los archivos multimedia (fotos y firmas) de pedidos entregados hace más de {count} {weeksLabel}?

# selectPharmacyRequired
source: You must select a pharmacy
es: Debes seleccionar una farmacia

source: No CSV data to upload
es: No hay datos CSV para subir

# csvUploadSuccess
source: CSV uploaded successfully. You will receive a notification when processing is complete.
es: CSV subido exitosamente. Recibirás una notificación cuando termine el procesamiento.

source: Error uploading CSV
es: Error al subir CSV

# csvTemplateReady
source: CSV template generated and ready to download.
es: Plantilla CSV generada y lista para descargar.

source: Error downloading template
es: Error al descargar plantilla

# generatePdfTitle
source: Generate PDF
es: Generar PDF

# filterByNameAddressHint
source: Filter by name, address
es: Filtrar por nombre, dirección

source: Deselect All
es: Deseleccionar Todo

# selectAllOrders
source: Select All
es: Seleccionar Todos

source: Error loading page
es: Error al cargar la página

# noDriverInfoAvailable
source: No driver information available
es: No hay información del repartidor disponible

# errorLoadingRouteDetails
source: Could not load route details
es: No se pudieron cargar los detalles de la ruta

# errorLoadingRouteDetailsWithError
source: Error loading details
es: Error al cargar detalles

# driverDetailsTitle
source: Driver Details
es: Detalles del Repartidor

# currentRouteLabel
source: Current Route
es: Ruta Actual

# routeIdLabel
source: Route ID
es: Ruta ID

# routeNameLabel
source: Route Name
es: Nombre de Ruta

# totalDistanceLabel
source: Total Distance
es: Distancia Total

# assignedOrdersLabel
source: Assigned Orders
es: Pedidos Asignados

# calculationDateLabel
source: Calculation Date
es: Fecha de Cálculo

# startDateLabel
source: Start Date
es: Fecha de Inicio

# completedDateLabel
source: Completed Date
es: Fecha de Completado

source: View Route
es: Ver Ruta

# ordersInOptimizedOrderCount
source: {count} orders in optimized order
es: {count} pedidos en orden optimizado

# pickupLocationLabel
source: Pickup Location
es: Ubicación Recojo

# deliveryLocationLabel
source: Delivery Location
es: Ubicación Entrega

# typeLabel
source: Type
es: Tipo

# ordersUpdatedSuccess
source: Orders updated successfully
es: Pedidos actualizados exitosamente

source: Error updating orders
es: Error al actualizar pedidos

# lessThanOneMonth
source: less than 1 month
es: menos de 1 mes

# aboutOneMonth
source: ~1 month
es: ~1 mes

# aboutMonthsCount
source: ~{count} months
es: ~{count} meses

# weeksBackDisplay
source: {count} {weeksLabel} ago
es: {count} {weeksLabel} hacia atrás

# weekShortLabel
source: wk
es: sem

source: Unknown error
es: Error desconocido

# csvValidationErrorsPrefix
source: Errors found in CSV:
es: Errores encontrados en el CSV:

source: Error changing items per page
es: Error al cambiar items por página

source: Copy Data
es: Copiar Datos

source: Generating PDF...
es: Generando PDF...

source: Loading orders for PDF...
es: Cargando pedidos para PDF...

# noPendingOrdersForPdf
source: No pending orders to generate PDF
es: No hay pedidos pendientes para generar PDF

# pendingOrdersPdfDescription
source: Pending orders will appear here to generate shipping labels
es: Los pedidos pendientes aparecerán aquí para generar etiquetas de envío

# dateToday
source: Today
es: Hoy

# dateYesterday
source: Yesterday
es: Ayer

# dateDayBeforeYesterday
source: Day before yesterday
es: Anteayer

# dateThreeDaysAgo
source: 3 days ago
es: Hace 3 días

# ordersCountLabel
source: {count, plural, =1{1 order} other{{count} orders}}
es: {count, plural, =1{1 pedido} other{{count} pedidos}}

# pdfDownloadUrlNotReceived
source: PDF download URL was not received
es: No se recibió URL de descarga del PDF

source: Unknown error generating PDF
es: Error desconocido al generar PDF

source: Error generating PDF
es: Error al generar PDF

# errorGeneratingPdfWithError
source: Error generating PDF: {error}
es: Error al generar PDF: {error}

# pdfGenerationTimeout
source: PDF generation took too long. Try with fewer labels.
es: La generación del PDF tardó demasiado. Intente con menos etiquetas.

# onlyPending
source: Pending Only
es: Solo Pendientes

source: Understood
es: Entendido

# csvHelpTitle
source: Help - Upload CSV
es: Ayuda - Cargar CSV

# csvHelpHowToUse
source: How to use this tool:
es: Cómo usar esta herramienta:

# csvHelpStep1Title
source: 1. Download template
es: 1. Descargar plantilla

# csvHelpStep1Description
source: Click the download icon to get the CSV template with the required columns.
es: Haz clic en el ícono de descarga para obtener la plantilla CSV con las columnas necesarias.

# csvHelpStep2Title
source: 2. Fill in data
es: 2. Llenar datos

# csvHelpStep2Description
source: Complete the template with order data. Coordinates must be in "latitude, longitude" format.
es: Completa la plantilla con los datos de los pedidos. Las coordenadas deben estar en formato "latitud, longitud".

# csvHelpStep3Title
source: 3. Upload file
es: 3. Cargar archivo

# csvHelpStep3Description
source: Drag and drop your CSV file or click to select it.
es: Arrastra y suelta tu archivo CSV o haz clic para seleccionarlo.

# csvHelpStep4Title
source: 4. Select pharmacy
es: 4. Seleccionar farmacia

# csvHelpStep4Description
source: Choose the pharmacy to which the orders will be assigned.
es: Elige la farmacia a la que se asignarán los pedidos.

# csvHelpStep5Title
source: 5. Process
es: 5. Procesar

# csvHelpStep5Description
source: Click "Process" to upload the orders to the system.
es: Haz clic en "Procesar" para cargar los pedidos al sistema.

# csvHelpTipTitle
source: Important tip:
es: Tip importante:

# csvHelpTipCoordinates
source: Coordinates must be in decimal format: "26.037737, -80.179550" for USA.
es: Las coordenadas deben estar en formato decimal: "26.037737, -80.179550" para EEUU.

source: Order assigned to {name}
es: Pedido asignado a {name}

# errorAssigningOrder
source: Error assigning
es: Error al asignar

source: Date of {type}
es: Fecha de {type}

source: No pharmacies to show
es: No hay farmacias para mostrar

source: No responsible
es: Sin responsable

source: No phone
es: Sin teléfono

source: No city
es: Sin ciudad

# tableHeaderAddress
source: ADDRESS
es: DIRECCIÓN

# tableHeaderResponsible
source: RESPONSIBLE
es: RESPONSABLE

# tableHeaderCity
source: CITY
es: CIUDAD

# tableHeaderLocation
source: LOCATION
es: UBICACIÓN

source: Error loading pharmacies for form
es: Error al cargar farmacias para el formulario

# errorLoadingData
source: Error loading data: {error}
es: Error al cargar datos: {error}

# selectLocationOnMap
source: You must select a location on the map
es: Debe seleccionar una ubicación en el mapa

# orderUpdatedSuccess
source: Order updated successfully
es: Pedido actualizado exitosamente

# orderCreatedSuccess
source: Order created successfully
es: Pedido creado exitosamente

source: Error updating order
es: Error al actualizar pedido

source: Error creating order
es: Error al crear pedido

# errorSavingOrder
source: Error saving: {error}
es: Error al guardar: {error}

source: Edit Delivery
es: Editar Entrega

source: New Delivery
es: Nueva Entrega

source: Creating new delivery
es: Creando nueva entrega

source: Save Delivery
es: Guardar Entrega

# districtRequired
source: District is required
es: El distrito es requerido

# deliveryAddressLine1Required
source: Delivery address line 1 is required
es: La dirección línea 1 es requerida

# orderStatusLabel
source: Order Status
es: Estado del Pedido

# quantityLabelShort
source: Quantity: {count}
es: Cantidad: {count}

# medicationDefaultName
source: Medication
es: Medicamento

# selectDriverForOrderHint
source: Select a driver to assign to the order
es: Selecciona un repartidor para asignar al pedido

# buildingAccessCodeHelper
source: Code to access building or condominium
es: Código para acceder al edificio o condominio

# phoneRequired
source: Phone is required
es: El teléfono es requerido

source: Error unassigning driver
es: Error al retirar repartidor

# errorAssigningDriver
source: Error assigning driver: {detail}
es: Error al asignar: {detail}

source: Error fetching updated data
es: Error al obtener datos actualizados

# clientNameRequired
source: Client name is required
es: El nombre del cliente es requerido

# medicationNameRequired
source: Name is required
es: El nombre es requerido

# medicationQuantityRequired
source: Quantity is required
es: La cantidad es requerida

# phoneLengthBetween
source: Phone must be between 10 and 12 digits
es: El teléfono debe tener entre 10 y 12 dígitos

# errorChangingDriver
source: Error changing driver: {error}
es: Error al cambiar repartidor: {error}

# errorRefreshingData
source: Error refreshing data: {error}
es: Error al refrescar datos: {error}

# enterValidQuantity
source: Enter a valid quantity
es: Ingresa una cantidad válida

# uploadOrdersFromCsvTitle
source: Upload Orders from CSV
es: Cargar Pedidos desde CSV

# backTooltip
source: Back
es: Volver

# downloadCsvTemplateTooltip
source: Download CSV template
es: Descargar plantilla CSV

# helpTooltip
source: Help
es: Ayuda

# validationProgressTitle
source: Validation Progress
es: Progreso de Validación

source: All records have valid coordinates
es: Todos los registros tienen coordenadas válidas

# dragDropCsvHere
source: Drag and drop your CSV file here
es: Arrastra y suelta tu archivo CSV aquí

# orClickToSelectFile
source: or click to select a file
es: o haz clic para seleccionar un archivo

# fileInfoTitle
source: File information
es: Información del archivo

# fileSizeFormatHint
source: Max size: 10MB • Format: CSV • Encoding: UTF-8
es: Tamaño máximo: 10MB • Formato: CSV • Codificación: UTF-8

# csvFileLabel
source: CSV file
es: Archivo CSV

# recordsLoadComplete
source: {fileName} - {count} records - Load complete
es: {fileName} - {count} registros - Carga completa

source: Select Pharmacy to assign orders
es: Seleccionar Farmacia para asignar pedidos

source: No data to show
es: No hay datos para mostrar

# selectCsvFileToPreview
source: Select a CSV file to preview the data
es: Selecciona un archivo CSV para ver una vista previa de los datos

source: No location
es: Sin ubicación

source: Empty field
es: Campo vacío

# processButton
source: Process
es: Procesar

source: Error loading pharmacies for export
es: Error al cargar farmacias para exportar

# recordsValidCount
source: {valid}/{total} valid
es: {valid}/{total} válidos

# recordsNeedValidCoordinates
source: {count} records need valid coordinates
es: {count} registros necesitan coordenadas válidas

# userCanAccessSystem
source: User can access the system
es: El usuario puede acceder al sistema
